CSI API ETABS v1
cCaseStaticNonlinearStaged.SetResultsSaved Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetResultsSaved(
	string Name,
	int StagedSaveOption,
	int StagedMinSteps = 1,
	int StagedMinStepsTD = 1
)
Function SetResultsSaved (
	Name As String,
	StagedSaveOption As Integer,
	Optional StagedMinSteps As Integer = 1,
	Optional StagedMinStepsTD As Integer = 1
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim StagedSaveOption As Integer
Dim StagedMinSteps As Integer
Dim StagedMinStepsTD As Integer
Dim returnValue As Integer
returnValue = instance.SetResultsSaved(Name,
	StagedSaveOption, StagedMinSteps,
	StagedMinStepsTD)
int SetResultsSaved(
	String^ Name,
	int StagedSaveOption,
	int StagedMinSteps = 1,
	int StagedMinStepsTD = 1
)
abstract SetResultsSaved :
        Name : string *
        StagedSaveOption : int *
        ?StagedMinSteps : int *
        ?StagedMinStepsTD : int
(* Defaults:
        let _StagedMinSteps = defaultArg StagedMinSteps 1
        let _StagedMinStepsTD = defaultArg StagedMinStepsTD 1
*)
-> int
Parameters
Name
Type: System.String
StagedSaveOption
Type: System.Int32
StagedMinSteps (Optional)
Type: System.Int32
StagedMinStepsTD (Optional)
Type: System.Int32
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace